backend/controllers/GoodsController.php

                    $model = new GoodsGallery();
                    $model->goods_id = \Yii::$app->request->post('goods_id');
                    $model->img = $action->getWebUrl();
                    $model->save();
---
INSERT INTO `img` (`goods_id`, `img`) VALUES (17, '/upload/53/47/5347f3d59d54f774eade7d6e46ce37c598f0d496.jpg')