backend/controllers/Goods_categoryController.php

SELECT * FROM `goods_category` ORDER BY `tree`, `lft`
---
    public function actionIndex()
    {
        $categories = Goods_category::find()->orderBy('tree,lft')->all();