backend/controllers/OrderController.php

    public function actionIndex(){
        $orders = Order::find()->all();
---
SELECT * FROM `order`

    public function actionUpdate($id){
        $orders = Order::findOne(['id'=>$id]);
        if($orders){
            $orders->status=1;
            $orders->save();
---
SELECT * FROM `order` WHERE `id`='23'
UPDATE `order` SET `status`=1 WHERE `id`=23

    public function actionOrder_goods($order_id){
        $order_goodss=Order_goods::findAll(['order_id'=>$order_id]);
---
SELECT * FROM `order_goods` WHERE `order_id`='22'