frontend/controllers/FlowController.php

    public function actionFlow1(){
        if(\Yii::$app->user->isGuest) {//用户未登录
            //取出cookie中的商品id和数量
            $cookies = \Yii::$app->request->cookies;
            $cookie = $cookies->get('cart');
            if ($cookie == null) {
                //cookie中没有购物车数据
                $cart = [];
            } else {
                $cart = unserialize($cookie->value);
            }
            $models = [];
            foreach ($cart as $good_id => $amount) {
                $goods = Goods::findOne(['id' => $good_id])->attributes;
                $goods['amount'] = $amount;
                $models[] = $goods;
            }
        }else{//用户登录
            $nid=\Yii::$app->user->getId();
            //判断cookie中是否缓存有商品
            $cookies = \Yii::$app->request->cookies;
            $cookie = $cookies->get('cart');
            if($cookie){//判断cookie中缓存的商品
                $cart = unserialize($cookie->value);
                foreach ($cart as $goods_id => $amount) {
                    //判断cookie中缓存的商品 在数据库中是否有
                    $carts=Cart::findOne(['nid'=>$nid,'goods_id'=>$goods_id]);
                    if($carts){
                        $carts->nm +=$amount;//有 直接修改该类商品的数量
                        $carts->save();
---
SELECT * FROM `goods` WHERE `id`=17
SELECT * FROM `cart` WHERE (`nid`=4) AND (`goods_id`=17)
UPDATE `cart` SET `nm`=8 WHERE `id`=16

                $coos->get('cart');
                $coos->remove('cart');
            }
            $carts=Cart::findAll(['nid'=>$nid]);
            $car=new Cart();
            $models = [];
            foreach ($carts as $cart) {
                $goods = Goods::findOne(['id' => $cart->goods_id])->attributes;
---
SELECT * FROM `cart` WHERE `nid`=4
SELECT * FROM `goods` WHERE `id`=17

    public function actionFlow2(){
        if(\Yii::$app->user->isGuest){
            return $this->redirect(['flow/flow1']);
        }
        //获取用户id
        $nid=\Yii::$app->user->getId();
        //查询 用户地址
        $address=Address::find()->where(['nid'=>$nid])->orderBy('status DESC')->all();
        //发货方式
        $payments=self::$payments;
        //支付方式
        $shippings=self::$shippings;
        //获取该用户购物车中的商品数据
        $carts=Cart::findAll(['nid'=>$nid]);
        $count=Cart::find()->where(['nid'=>$nid])->count();
        $car=new Cart();
        $models = [];
        foreach ($carts as $cart) {
            $goods = Goods::findOne(['id' => $cart->goods_id])->attributes;
---
SELECT * FROM `address` WHERE `nid`=4 ORDER BY `status` DESC
SELECT * FROM `cart` WHERE `nid`=4
SELECT COUNT(*) FROM `cart` WHERE `nid`=4
SELECT * FROM `goods` WHERE `id`=17

    public function actionAdd(){
        //获取商品数量 商品id
        $goods_id = \Yii::$app->request->post('goods_id');
        $amount = \Yii::$app->request->post('amount');
        $update = \Yii::$app->request->post('update');
        $goods = Goods::findOne(['id'=>$goods_id]);
---
SELECT * FROM `goods` WHERE `id`='17'

            //获取用户id
            $nid=\Yii::$app->user->getId();
            //根据用户id 和商品id查询 购物车中是否有该商品
            $cart=Cart::findOne(['nid'=>$nid,'goods_id'=>$goods_id]);
---
SELECT * FROM `cart` WHERE (`nid`=4) AND (`goods_id`='17')

                    $carts->nid=$nid;
                    $carts->goods_id=$goods_id;
                    $carts->nm=$amount;
                    $carts->save();
---
INSERT INTO `cart` (`nid`, `goods_id`, `nm`) VALUES (4, 17, 6)

    public function actionOrder(){
        if(\Yii::$app->user->isGuest){//未登录
           return $this->redirect(['flow/flow1']);
        }
        $nid=\Yii::$app->user->getId();//获取用户id
        $addres=\Yii::$app->request->post('addres');
        $shipping=\Yii::$app->request->post('shipping');//配送方式
        //var_dump($shipping);
        $pay_select=\Yii::$app->request->post('pay_select');//支付方式
        $tfoot_all=\Yii::$app->request->post('tfoot_all');//总金额
        $order=new Order();
        $order->member_id=$nid;//用户id
        $address=Address::findOne(['id'=>$addres]);
---
SELECT * FROM `address` WHERE `id`='5'

        //开启事务
        $transaction = \Yii::$app->db->beginTransaction();
        try{
            $order->save();
            $carts=Cart::findAll(['nid'=>$nid]);
---
INSERT INTO `order` (`member_id`, `name`, `province`, `city`, `area`, `address`, `tel`, `delivery_id`, `delivery_name`, `delivery_price`, `payment_id`, `payment_name`, `total`, `status`, `trade_no`, `create_time`) VALUES (4, '李宁', '23', '385', '4209', '锦城大道一段', 2147483647, 1, '普通快递送货上门', '10.00', 2, '在线支付', '16', 0, '201706261557', 1498467933)
SELECT * FROM `cart` WHERE `nid`=4

                $order_goods=new Order_goods();
                $order_goods->order_id=$order->id;
                $order_goods->goods_id=$cart->goods_id;
                $goods=Goods::findOne(['id'=>$cart->goods_id]);
---
SELECT * FROM `goods` WHERE `id`=17

                //减库存
                $goods->stock=$goods->stock-$cart->nm;
                $goods->save();
                $order_goods->save();
            }
            //删除购物车中的商品
            Cart::deleteAll(['nid'=>$nid]);
---
INSERT INTO `order_goods` (`order_id`, `goods_id`, `goods_name`, `logo`, `price`, `amount`, `total`) VALUES (29, 17, '测试', '/upload/88/93/8893bf7bf792936d27a53e54fa41d5419f773686.jpg', '1.00', 8, '8')
UPDATE `goods` SET `stock`=3 WHERE `id`=17
INSERT INTO `order` (`member_id`, `name`, `province`, `city`, `area`, `address`, `tel`, `delivery_id`, `delivery_name`, `delivery_price`, `payment_id`, `total`, `status`, `trade_no`, `create_time`) VALUES (4, '李宁', '23', '385', '4209', '锦城大道一段', 2147483647, 1, '在线支付', '10.00', 2, '18', 0, '201706264514', 1498466782)
DELETE FROM `cart` WHERE `nid`=4