frontend/controllers/OtherController.php

SELECT * FROM `brand`
SELECT * FROM `goods_category` WHERE `id`='7'
SELECT COUNT(*) FROM `goods` WHERE `goods_category_id` IN (33, 34, 35, 36)
SELECT * FROM `goods` WHERE `goods_category_id` IN (33, 34, 35, 36) LIMIT 6
SELECT * FROM `goods_category` WHERE (`tree`=5) AND (`parent_id`=0)
---
    public function actionList($id){
        $brand=Brand::find()->all();
        //判断所传来的id 代表商品分类的成级
        $depth=Goods_category::findOne($id);
        $children=$depth->children;

        if($children){
            $child_id=[];
           foreach ($children as $child){
               $categoty=$child->children;
               if($categoty){
                   foreach ($categoty as $cate){
                       $child_id[] =$cate->id;
                   }

               }
               $child_id[]=$child->id;
           }
            $query=Goods::find()->where(['goods_category_id' => $child_id]);
        }else{
            $query=Goods::find()->where(['goods_category_id' => $id]);
        }
        //获取所有的该品牌分类的所有的商品
        //总条数  每页显示几条  当前第几页
        $total=$query->count();
        $page= new Pagination([
            'totalCount'=>$total,
            'defaultPageSize'=>6,
        ]);
        $goodses=$query->offset($page->offset)->limit($page->limit)->all();
        $tree=Goods_category::findOne(['id'=>$id]);
        $goods_category=Goods_category::findOne(['tree'=>$tree->tree,'parent_id'=>0]);

SELECT * FROM `goods` WHERE `id`='17'
SELECT * FROM `img` WHERE `goods_id`='17'
---
    public function actionGood($id){
        $goods=Goods::findOne($id);
        $imgs=Img::find()->where(['goods_id'=>$id])->all();

SELECT * FROM `order` WHERE `member_id`=4
---
    public function actionOrder(){
        $nid=\Yii::$app->user->getId();
        $orders=Order::find()->where(['member_id'=>$nid])->all();