frontend/controllers/UserController.php

    public function actionLogin(){
        $model=new LoginForm();
        if($model->load(\Yii::$app->request->post()) && $model->validate()){
            //成功登陆后 获取该用户的信息
            $user=Member::findOne(['username'=>$model->username]);
---
SELECT * FROM `member` WHERE `username`='ln0713'