frontend/views/layouts/index.php

                    <div class="prompt">
                        <?php
                        $nid=\Yii::$app->user->getId();
                        $count=\frontend\models\Cart::find()->where(['nid'=>$nid])->count();
---
SELECT COUNT(*) FROM `cart` WHERE `nid`=4