frontend/views/other/list.php


            <h2><?php echo $goods_category->name ?></h2>
            <div class="catlist_wrap">
                <?php $children =\frontend\models\Goods_category::findAll(['parent_id'=> $goods_category->id]) ?>
---
SELECT * FROM `goods_category` WHERE `parent_id`=5

                    <div class="child">
                    <h3 <?php echo $child->id==$id ? 'class="on"' : ''?>><b></b><?php echo $child->name ?></h3>
                        <ul <?php echo $k==0? '' : 'class="none" '?> >
                            <?php $cates =\frontend\models\Goods_category::findAll(['parent_id'=> $child->id]) ?>
---
SELECT * FROM `goods_category` WHERE `parent_id`=7