backend/models/User.php

SELECT * FROM `user` WHERE `id`=4
---
    public static function findIdentity($id)
    {
        return self::findOne(['id'=>$id]);