backend/widgets/MenuWidget.php

SELECT * FROM `menu` WHERE `parent_id`=0
---
    public function run(){
        NavBar::begin([
            'brandLabel' => '我的商城管理系统',
            'brandUrl' => Yii::$app->homeUrl,
            'options' => [
                'class' => 'navbar-inverse navbar-fixed-top',
            ],
        ]);
        $menuItems = [
            ['label'=>'首页','url'=>['/goods/index']],
        ];
        if (Yii::$app->user->isGuest) {
            $menuItems[] = ['label' => '登陆', 'url' => ['/login/index']];
        } else {
            //根据用户权限显示菜单
//          $menuItems[] = ['label' =>'品牌管理', 'items'=>[
//                ['label' => '品牌列表', 'url' => ['/brand/index']],
//                ['label' => '添加品牌', 'url' => ['/brand/add']],
//            ]];
            //获取所有一级菜单
            $menus = Menu::findAll(['parent_id'=>0]);