frontend/models/LoginForm.php

    public function validateUsername(){
        //获取用户信息
        $member= Member::findOne(['username'=>$this->username]);
---
SELECT * FROM `member` WHERE `username`='ln0713'