frontend/models/Member.php

    public static function findIdentity($id)
    {
        return self::findOne(['id'=>$id]);
---
SELECT * FROM `member` WHERE `id`=4